# ZoneEquipmentData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ZoneEquipmentData Class
Members See Also
---
Represents the data and parameters of analytical zone equipment.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public class ZoneEquipmentData : IDisposable
```

Visual Basic
---
```text
Public Class ZoneEquipmentData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ZoneEquipmentData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..ZoneEquipmentData
# See Also
ZoneEquipmentData Members
Autodesk.Revit.DB.Mechanical Namespace